{
 "cells": [
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 1<br>\n",
    "Дана переменная, в которой хранится словарь, содержащий гео-метки для каждого пользователя<br> (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран множество<br> уникальных гео-меток всех пользователей.\n",
    "\n",
    "Пример работы программы:<br>\n",
    "\n",
    "<code/>ids = {‘user1’: [213, 213, 213, 15, 213],\n",
    "‘user2’: [54, 54, 119, 119, 119],\n",
    "‘user3’: [213, 98, 98, 35]}</code> <br>\n",
    "Результат: {98, 35, 15, 213, 54, 119}"
   ],
   "id": "b8ac03a6257b0f32"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T19:17:33.493780100Z",
     "start_time": "2026-02-08T19:17:33.466642Z"
    }
   },
   "cell_type": "code",
   "source": [
    "ids = {'user1': [213, 213, 213, 15, 213],\n",
    "'user2': [54, 54, 119, 119, 119],\n",
    "'user3': [213, 98, 98, 35]}\n",
    "\n",
    "unic_geo_tags = set()\n",
    "\n",
    "for geo_tag in ids.values():\n",
    "    unic_geo_tags.update(geo_tag)\n",
    "print('Результат: ' + str(unic_geo_tags))"
   ],
   "id": "f15e99863f3ba41a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Результат: {98, 35, 15, 213, 54, 119}\n"
     ]
    }
   ],
   "execution_count": 1
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 2<br>\n",
    "Дана переменная, в которой хранится список поисковых запросов пользователя<br> (пример структуры данных приведен ниже, но запросы потенциально могут быть любые). Вам необходимо<br> написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "\n",
    "Пример работы программы:<br>\n",
    "<code/>\n",
    "queries = [\n",
    "‘смотреть сериалы онлайн’,\n",
    "‘новости спорта’,\n",
    "‘афиша кино’,\n",
    "‘курс доллара’,\n",
    "‘сериалы этим летом’,\n",
    "‘курс по питону’,\n",
    "‘сериалы про спорт’,\n",
    "]</code><br>\n",
    "Результат:<br>\n",
    "\n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%<br>\n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%"
   ],
   "id": "ba7eb5bde0becb5d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T20:52:00.441536200Z",
     "start_time": "2026-02-08T20:52:00.394097100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "queries = [\n",
    "'смотреть сериалы онлайн',\n",
    "'новости спорта',\n",
    "'афиша кино',\n",
    "'курс доллара',\n",
    "'сериалы этим летом',\n",
    "'курс по питону',\n",
    "'сериалы про спорт'\n",
    "]\n",
    "len_count_map = {}\n",
    "\n",
    "for query in queries:\n",
    "    query_len = len(query.split(' '))\n",
    "    if query_len not in len_count_map:\n",
    "        len_count_map[query_len] = 1\n",
    "    else:\n",
    "        len_count_map[query_len] += 1\n",
    "\n",
    "total = len(queries)\n",
    "for word_count in sorted(len_count_map.keys()):\n",
    "    count = len_count_map[word_count]\n",
    "    percentage = (count / total) * 100\n",
    "    print(f'Поисковых запросов, содержащих {word_count} слов(а): {percentage:.2f}%')"
   ],
   "id": "4eb815b2d741fafc",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
      "Поисковых запросов, содержащих 3 слов(а): 57.14%\n"
     ]
    }
   ],
   "execution_count": 1
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 3<br>\n",
    "Дана переменная, в которой хранится информация о затратах и доходе рекламных кампаний по различным источникам. Необходимо дополнить исходную структуру показателем ROI,<br> который рассчитаем по формуле: ((revenue / cost) - 1) * 100<br>\n",
    "\n",
    "Пример работы программы:<br>\n",
    "\n",
    "results = {<br>\n",
    "‘vk’: {‘revenue’: 103, ‘cost’: 98},<br>\n",
    "‘yandex’: {‘revenue’: 179, ‘cost’: 153},<br>\n",
    "‘facebook’: {‘revenue’: 103, ‘cost’: 110},<br>\n",
    "‘adwords’: {‘revenue’: 35, ‘cost’: 34},<br>\n",
    "‘twitter’: {‘revenue’: 11, ‘cost’: 24},<br>\n",
    "}<br>\n",
    "Результат:<br>\n",
    "\n",
    "{‘adwords’: {‘revenue’: 35, ‘cost’: 34, ‘ROI’: 2.94},<br>\n",
    "‘facebook’: {‘revenue’: 103, ‘cost’: 110, ‘ROI’: -6.36},<br>\n",
    "‘twitter’: {‘revenue’: 11, ‘cost’: 24, ‘ROI’: -54.17},<br>\n",
    "‘vk’: {‘revenue’: 103, ‘cost’: 98, ‘ROI’: 5.1},<br>\n",
    "‘yandex’: {‘revenue’: 179, ‘cost’: 153, ‘ROI’: 16.99}}<br>"
   ],
   "id": "4693b5e770d04d9a"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T21:11:56.711058Z",
     "start_time": "2026-02-08T21:11:56.660317600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "results = {\n",
    "'vk': {'revenue': 103, 'cost': 98},\n",
    "'yandex': {'revenue': 179, 'cost': 153},\n",
    "'facebook': {'revenue': 103, 'cost': 110},\n",
    "'adwords': {'revenue': 35, 'cost': 34},\n",
    "'twitter': {'revenue': 11, 'cost': 24},\n",
    "}\n",
    "\n",
    "for key in results.keys():\n",
    "    data = results[key]\n",
    "    roi = round(((data['revenue'] / data['cost']) - 1) * 100, 2)\n",
    "    data['ROI'] = roi\n",
    "\n",
    "sorted_results = dict(sorted(results.items()))\n",
    "\n",
    "for source, data in sorted_results.items():\n",
    "    print(f\"'{source}': {data}\")"
   ],
   "id": "688ae9f23a3bd764",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'adwords': {'revenue': 35, 'cost': 34, 'ROI': 2.94}\n",
      "'facebook': {'revenue': 103, 'cost': 110, 'ROI': -6.36}\n",
      "'twitter': {'revenue': 11, 'cost': 24, 'ROI': -54.17}\n",
      "'vk': {'revenue': 103, 'cost': 98, 'ROI': 5.1}\n",
      "'yandex': {'revenue': 179, 'cost': 153, 'ROI': 16.99}\n"
     ]
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 4<br>\n",
    "Дана переменная, в которой хранится статистика рекламных каналов по объемам продаж<br> (пример структуры данных приведен ниже). Напишите программу, которая возвращает название канала с максимальным объемом продаж.<br>\n",
    "\n",
    "Пример работы программы:<br>\n",
    "\n",
    "<code/>stats = {‘facebook’: 55, ‘yandex’: 115, ‘vk’: 120, ‘google’: 99, ‘email’: 42, ‘ok’: 98}</code><br>\n",
    "\n",
    "Результат: Максимальный объем продаж на рекламном канале: vk"
   ],
   "id": "ea8f3f482215ebff"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T21:16:44.785210200Z",
     "start_time": "2026-02-08T21:16:44.726211100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "stats = {'facebook': 55, 'yandex': 115, 'vk': 120, 'google': 99, 'email': 42, 'ok': 98}\n",
    "\n",
    "max_channel = max(stats, key = stats.get)\n",
    "print(f'Максимальный объем продаж на рекламном канале: {max_channel}')"
   ],
   "id": "2feafccaa223dae3",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Максимальный объем продаж на рекламном канале: vk\n"
     ]
    }
   ],
   "execution_count": 10
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
