{
 "cells": [
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 1<br>\n",
    "Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n",
    "\n",
    "среднюю букву, если число букв в слове нечетное;<br>\n",
    "две средних буквы, если число букв четное.<br>\n",
    "Примеры работы программы:<br>\n",
    "\n",
    "word = 'test’<br>\n",
    "Результат:<br>\n",
    "es<br>\n",
    "\n",
    "word = 'testing’<br>\n",
    "Результат:<br>\n",
    "t"
   ],
   "id": "8a77807f92f26ee"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T13:48:40.179128600Z",
     "start_time": "2026-02-08T13:48:40.132879800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "word = 'test'\n",
    "length = len(word)\n",
    "mid = length // 2\n",
    "if (length % 2  > 0):\n",
    "    print(word[mid])\n",
    "else:\n",
    "    print(word[mid - 1] + word[mid])"
   ],
   "id": "fbc121e30a2defb3",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "es\n"
     ]
    }
   ],
   "execution_count": 4
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 2<br>\n",
    "Напишите программу, которая последовательно запрашивает у пользователя числа<br> (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел.\n",
    "\n",
    "Примеры работы программы: 1.<br>\n",
    "\n",
    "Введите число: 1<br>\n",
    "\n",
    "Введите число: 4<br>\n",
    "\n",
    "Введите число: 6<br>\n",
    "\n",
    "Введите число: 0<br>\n",
    "Результат:11<br>\n",
    "\n",
    "Введите число: 0<br>\n",
    "Результат:0"
   ],
   "id": "c5dd252538e6c56c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T14:15:12.525706400Z",
     "start_time": "2026-02-08T14:15:09.389045700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "summ = 0\n",
    "loop = True\n",
    "while loop:\n",
    "    number = int(input('введите цифру: '))\n",
    "    if number == 0:\n",
    "        loop = False\n",
    "        print(summ)\n",
    "    else:\n",
    "        summ = summ + number\n"
   ],
   "id": "a509038c60e2fbd4",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n"
     ]
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 3 <br>\n",
    "Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.<br>\n",
    "Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами <br> после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:<br>\n",
    "\n",
    "Примеры работы программы: 1.<br>\n",
    "\n",
    "boys = [‘Peter’, ‘Alex’, ‘John’, ‘Arthur’, ‘Richard’]<br>\n",
    "girls = [‘Kate’, ‘Liza’, ‘Kira’, ‘Emma’, ‘Trisha’]<br>\n",
    "Результат:<br>\n",
    "\n",
    "Идеальные пары:<br>\n",
    "Alex и Emma<br>\n",
    "Arthur и Kate<br>\n",
    "John и Kira<br>\n",
    "Peter и Liza<br>\n",
    "Richard и Trisha<br>\n",
    "boys = [‘Peter’, ‘Alex’, ‘John’, ‘Arthur’, ‘Richard’, ‘Michael’]<br>\n",
    "girls = [‘Kate’, ‘Liza’, ‘Kira’, ‘Emma’, ‘Trisha’]<br>\n",
    "Результат:<br>\n",
    "Внимание, кто-то может остаться без пары!<br>"
   ],
   "id": "82301ffe3a253923"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T16:04:14.076361400Z",
     "start_time": "2026-02-08T16:04:14.043356800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']\n",
    "girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n",
    "\n",
    "if len(boys) == len(girls):\n",
    "    sorted_boys = sorted(boys)\n",
    "    sorted_girls = sorted(girls)\n",
    "    for i in range(len(sorted_boys)):\n",
    "        print(sorted_boys[i] + ' и ' + sorted_girls[i])\n",
    "else:\n",
    "    print('Внимание, кто-то может остаться без пары!')"
   ],
   "id": "8fa3d758d18ff7b5",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Alex и Emma\n",
      "Arthur и Kate\n",
      "John и Kira\n",
      "Peter и Liza\n",
      "Richard и Trisha\n"
     ]
    }
   ],
   "execution_count": 19
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Задание 4<br>\n",
    "У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах <br>за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период<br> в Цельсиях(!) для каждой страны.\n",
    "\n",
    "Пример работы программы:<br>\n",
    "\n",
    "countries_temperature = [<br>\n",
    "[‘Таиланд’, [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],<br>\n",
    "[‘Германия’, [57.2, 55.4, 59, 59, 53.6]],<br>\n",
    "[‘Россия’, [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],<br>\n",
    "[‘Польша’, [50, 50, 53.6, 57.2, 55.4, 55.4]]<br>\n",
    "]<br>\n",
    "Результат:<br>\n",
    "\n",
    "Средняя температура в странах:<br>\n",
    "Таиланд - 23.9 С<br>\n",
    "Германия - 13.8 С<br>\n",
    "Россия - 3.7 С<br>\n",
    "Польша - 12.0 С<br>"
   ],
   "id": "a6708427847f13d9"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-02-08T16:27:03.018994100Z",
     "start_time": "2026-02-08T16:27:02.972732700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "countries_temperature = [\n",
    "['Таиланд', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n",
    "['Германия', [57.2, 55.4, 59, 59, 53.6]],\n",
    "['Россия', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n",
    "['Польша', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n",
    "]\n",
    "\n",
    "print('Средняя температура в странах:')\n",
    "\n",
    "for i in range(len(countries_temperature)):\n",
    "    country_name = countries_temperature[i][0]\n",
    "    temperature_arr = countries_temperature[i][1]\n",
    "\n",
    "    mid_temp = round((sum(temperature_arr) / len(temperature_arr)) - 32 / 1.8, 1)\n",
    "\n",
    "    print(country_name + ' - ' + str(mid_temp) + 'C')"
   ],
   "id": "9432a38e4b025d32",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Средняя температура в странах:\n",
      "Таиланд - 57.2C\n",
      "Германия - 39.1C\n",
      "Россия - 20.9C\n",
      "Польша - 35.8C\n"
     ]
    }
   ],
   "execution_count": 24
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
